Split Method
Splits the family instance element at a point on its defining curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId Split(
	double param
)
Visual Basic
Public Function Split ( _
	param As Double _
) As ElementId
Visual C++
public:
ElementId^ Split(
	double param
)
Parameters
param
Type: SystemDouble
The normalized parameter value along the element (should be greater than 0 and less than 1).
Return Value
The newly created family instance id.
Remarks
Splitting is permitted for architectural and structural columns, beams and braces. Beams and braces that are not a line or an arc is not permitted. See CanSplit to determine if the family instance is allowed to be split by this method.
Splitting modifies this family instance and adds a second family instance to the model.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException | Thrown when parameter is out of range.
Autodesk.Revit.ExceptionsInvalidOperationException | Thrown when the family instance element cannot be split.
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →